[
  {
    "id": 1,
    "nom": "Portfolio",
    "categorie": "Projet personnel, école",
    "ue": "Développer, Entreprendre",
    "task": "Développer un portfolio personnel et fonctionnel pour présenter mes projets et compétences en développement web.",
    "livrable": "Portfolio",
    "analyse": "Dans le cadre de mon projet personnel, j'ai décidé de créer un portfolio pour mettre en avant mes compétences et mes projets réalisés durant ma formation. Le but était de concevoir un site web simple, efficace et esthétique, qui puisse servir de vitrine pour mes réalisations. J'ai choisi d'utiliser Next.js pour le développement côté serveur et Tailwind CSS pour le design, afin d'assurer une expérience utilisateur fluide et agréable. Le site est structuré de manière à présenter mes projets et mes compétences tant scolaires que professionnelles et personnelles. J'ai également intégré une galerie d'images pour illustrer mes réalisations. Le projet a été réalisé dans le cadre de l'évaluation finale de ma 3e année de BUT MMI, afin de démontrer mes compétences et mes acquis en développement web.",
    "methode": "Pour concevoir un portfolio à la fois sobre et fonctionnel, j’ai commencé par définir les contenus à intégrer : la présentation de mes projets scolaires et professionnels, une galerie d’images, ainsi que des sections dédiées à deux projets spécifiques — Portfolio et Coulisses du domaine skiable. J’ai également inclus une analyse de mes compétences actuelles, organisée par pôles, afin de faire le point sur mon apprentissage. Le site a été développé avec Next.js pour la partie serveur et Tailwind CSS pour le design, afin d’assurer une interface moderne et cohérente. Il a ensuite été déployé sur la plateforme Vercel. J'ai utilisé GitHub pour le versioning et le déploiement, ce qui m'a permis de suivre l'évolution du projet. Le site est responsive et optimisé pour une navigation fluide sur tous les appareils. J'ai également intégré un outil d'analyse pour suivre les performances du site.",
    "ressources": "Apprentissage de la création d'un portfolio avec Next.js et Tailwind CSS. Utilisation de GitHub pour le versioning et le déploiement. Documentation de Next.js et Tailwind CSS pour la mise en place du projet. IA Gémini pour le débuggage et l'optimisation du code. Copilot pour l'aide à la création de certaines fonctions du code.",
    "ameliorations": "Ajout d'une section blog pour partager mes réflexions et mes projets en cours. Mise à jour régulière du contenu : Ajout de nouveaux projets et compétences au fur et à mesure de mon apprentissage.",
    "CEAC": "CE4.01 - Développer pour le web et les médias numériques en se conformant aux standards du web et aux normes d’accessibilités. CE4.03 - Développer pour le web et les médias numériques en produisant un code fonctionnel, sobre et réutilisable. AC34.04 - Concevoir et développer des composants logiciels, plugins ou extensions. AC34.05 - Maitriser l’hébergement et le déploiement d’applications. AC35.02 - Maîtriser la qualité en projet Web ou multimédia.",
    "apprentissage": "Utilisation de Next.js pour le développement côté serveur. Intégration de Tailwind CSS pour le design. Gestion du versioning et du déploiement avec GitHub. Création d'une galerie d'images dynamique. Mise en place d'une interface utilisateur intuitive et esthétique.",
    "image1": "",
    "lien": "https://github.com/clementdr/clement-portfolio"
  },
  {
    "id": 2,
    "nom": "Stratégie TikTok",
    "categorie": "Entreprise",
    "ue": "Entreprendre",
    "task": "Élaboration d'une stratégie TikTok innovante pour augmenter la visibilité et l'engagement. Création et planification de contenu créatif basé sur les tendances actuelles. Analyse des performances et ajustement de la stratégie. Engagement de la communauté et développement d'une interaction régulière.",
    "livrable": "Plan stratégique TikTok.",
    "analyse": "Dans le cadre de mon alternance, ce projet visait à développer une stratégie TikTok pour moderniser l’image de la station de Pralognan-la-Vanoise et cibler une audience plus jeune. Les phases du projet incluaient l'analyse du marché, la création de contenu, la planification, l'analyse des performances et l'engagement communautaire. L'objectif était d'accroître la visibilité en ligne et de diversifier les canaux de communication.",
    "methode": "Pour développer une stratégie TikTok efficace, j’ai suivi ces étapes : Analyse des tendances et benchmark : Étude des tendances et des pratiques concurrentielles. Création de contenu : Élaboration de vidéos courtes et engageantes. Planification stratégique : Mise en place d’un calendrier de publication adapté. Engagement communautaire : Interaction active avec les utilisateurs. Analyse de performance : Utilisation des outils d’analyse de TikTok pour évaluer et ajuster la stratégie.",
    "ressources": "Ressources numériques : TikTok et ses outils d’analyse, CapCut pour le montage vidéo. Sources d’inspiration : pages TikTok de stations touristiques et créateurs populaires. Autres ressources : Collaborations avec l’équipe communication.",
    "ameliorations": "Diversification des contenus : Intégration de contenu généré par les utilisateurs (UGC). Optimisation des collaborations : Partenariats avec des influenceurs locaux. Automatisation des analyses : Utilisation d’outils externes pour des rapports détaillés. Mesure d’impact à long terme : Mise en place d’indicateurs pour évaluer l’impact sur la fréquentation touristique.",
    "CEAC": "CE5.05 - Entreprendre dans le secteur du numérique en favorisant la sobriété numérique. CE5.01 - Entreprendre dans le secteur du numérique en s'appuyant sur une veille technologique et des modèles de l’innovation. AC33.03 - Maitriser les étapes de production d’un projet multimédia. AC35.04 - Défendre un projet de manière convaincante.",
    "apprentissage": "Acquis et apprentissages clés du projet : Utilisation de TikTok comme outil marketing. Identification et exploitation des tendances. Analyse des données de performance. Gestion d'une communauté en ligne.",
    "image1": "",
    "lien": "https://www.tiktok.com/@pralognanlavanoise"
  },
  {
    "id": 3,
    "nom": "Chat Websocket",
    "categorie": "École, dev web",
    "ue": "Développer",
    "task": "Développement d'une application de chat en temps réel utilisant JavaScript et les WebSockets. Conception de l'interface utilisateur pour faciliter les échanges de messages. Gestion de la communication en temps réel entre le client et le serveur via les WebSockets.",
    "livrable": "Application de chat en temps réel.",
    "analyse": "Dans le cadre de la SAE R506, ce projet visait à développer une application de chat en temps réel utilisant les WebSockets. L'objectif était de permettre une communication instantanée entre plusieurs utilisateurs connectés. Le développement a été structuré en plusieurs phases : mise en place du serveur WebSocket, développement côté serveur, développement côté client. Ce projet a permis d'approfondir mes compétences en développement temps réel, de la gestion serveur à l'interface utilisateur.",
    "methode": "Pour développer l’application de chat en temps réel, j’ai adopté une approche itérative structurée en plusieurs étapes clés : Conception du serveur WebSocket : Utilisation de Node.js et d’un module comme ws pour gérer les connexions simultanées. Développement côté serveur : Mise en place d’un système de gestion des événements pour recevoir et distribuer les messages. Développement côté client : Utilisation de JavaScript pour une interface utilisateur intuitive et la communication en temps réel. Tests : Simulation de plusieurs utilisateurs pour vérifier la fluidité et identifier les problèmes de performances.",
    "ressources": "Ressources techniques : Documentation de Node.js et du module ws. Tutoriels en ligne sur les WebSockets. Outils de développement : Environnement Node.js pour le serveur. Outils de débogage (DevTools) pour analyser les messages échangés.",
    "ameliorations": "Sécurité : Intégration de mécanismes d’authentification et de chiffrement. Optimisation des performances : Tests avec un grand nombre d’utilisateurs pour la scalabilité. Fonctionnalités supplémentaires : Notifications de connexion/déconnexion, prise en charge des fichiers multimédias.",
    "CEAC": "CE4.03 - Développer pour le web et les médias numériques en produisant un code fonctionnel, sobre et réutilisable. AC34.02 - Développer à l’aide d’un framework de développement côté serveur.",
    "apprentissage": "Acquis et apprentissages clés du projet : Utilisation des WebSockets pour une connexion en temps réel. Implémentation de fonctionnalités interactives en JavaScript. Gestion de l'envoi et de la réception de données en temps réel dans une application multi-utilisateurs.",
    "image1": "",
    "lien": "https://github.com/clementdr/chat-websocket"
  },

  {
    "id": 4,
    "nom": "AéroGuide API",
    "categorie": "École, dev web, API",
    "ue": "Développer",
    "task": "Développement d'une interface utilisateur pour l'extraction de données météorologiques via une API.  Implémentation des fonctionnalités de formatage et d'affichage d'informations sur les aéroports français.  Gestion des erreurs lors de la récupération des données. Intégration et formatage des données de date et météorologiques pour une lecture en français. Optimisation de l'expérience utilisateur avec un design interactif et responsive.",
    "livrable": "Réalisation d'une application web de recherche d'informations météorologiques et aéroportuaires françaises.",
    "analyse": "Dans le cadre de la SAE R505, ce projet visait à développer une application front-end permettant la recherche d'informations météorologiques et de détails sur les aéroports français via l'API OpenDataSoft. Le projet a été structuré en plusieurs phases : connexion à l'API, traitement des données, conception de l'interface utilisateur, et développement d'un design interactif et responsive. Ce projet a permis de consolider mes compétences en développement front-end et en manipulation d'API, tout en assurant une expérience utilisateur optimale.",
    "methode": "Pour développer l’application front-end permettant de rechercher des informations sur les aéroports et les conditions météo, j’ai procédé en plusieurs étapes : Analyse des besoins : Identifier les données nécessaires à extraire depuis l’API OpenDataSoft. Connexion à l’API : Configurer les appels API avec Axios pour la récupération de données JSON. Traitement des données : Manipuler et formater les informations (dates, météo, détails des aéroports) pour une présentation claire. Conception de l’interface : Utiliser Vue.js pour développer des composants dynamiques et interactifs. Amélioration de l'UX : Intégration d'un design responsive et gestion des erreurs de requêtes.",
    "ressources": "Ressources techniques : Guides et tutoriels sur Vue.js, Axios et date-fns. Outils de développement : Visual Studio Code. Navigateurs avec DevTools pour le test et le débogage.",
    "ameliorations": "Fonctionnalités supplémentaires : Ajouter des filtres pour trier les aéroports selon des critères spécifiques. Optimisation des performances : Implémenter la pagination ou la mise en cache des données pour réduire les temps de chargement. Amélioration de l'accessibilité : Veiller à rendre l’application utilisable par les personnes en situation de handicap (navigation clavier, lecteurs d’écran).",
    "CEAC": "CE4.03 - Développer pour le web et les médias numériques en produisant un code fonctionnel, sobre et réutilisable. AC34.01 - Développer à l’aide d’un framework de développement côté client.",
    "apprentissage": "Utilisation de l'API OpenDataSoft pour récupérer des données météorologiques et aéroportuaires. Manipulation de dates et formats avec date-fns pour la localisation en français. Gestion des requêtes API asynchrones avec Axios et traitement des réponses JSON. Création et affichage dynamique d'informations via des composants Vue.js. Développement d'une interface responsive avec une interaction utilisateur fluide.",
    "image1": "",
    "lien": "https://github.com/clementdr/weather-app"
  },
  {
    "id": 5,
    "nom": "SAE501 : Concevoir un dispositif interactif",
    "categorie": "École, dev web, éléctronique, 3D",
    "ue": "Développer",
    "task": "Concevoir une table basse interactive, éléments mis à disposition : écran non tactile, plateau de table, Arduino, impression additive.",
    "livrable": "Table basse interactive.",
    "analyse": "Dans le cadre de la SAE 501, ce projet visait à concevoir un dispositif interactif sous la forme d'une table basse. L'objectif était de créer une expérience utilisateur innovante en intégrant des éléments électroniques et de design. Nous avons choisi de réaliser une borne d'arcade : deux joueurs s'affrontent sur des mini-jeux, puis à chaque fin de partie une machine à cocktail distribue des boissons selon le choix des joueurs. Le projet a été structuré en plusieurs phases : conception du design, développement de l'interface utilisateur, intégration des éléments électroniques et tests. Ce projet a permis de développer mes compétences en développement web front et back, conception 3D et électronique.",
    "methode": "Pour concevoir la table basse interactive, j'ai suivi ces étapes : Élaboration de maquettes pour l'interface utilisateur et le design de la table. Développement de l'interface utilisateur en utilisant Typescript et React. Intégration des éléments électroniques : programmation de l'Arduino pour gérer les entrées/sorties et la communication avec l'écran, tests, ajustements et débuggage des fonctionnalités. Conception et impression 3D des éléments supports de la table (joysticks, boutons).",
    "ressources": "Ressources techniques : Arduino, écran non tactile, impression 3D pour les joysticks et les boutons. Autres ressources : Collaboration avec l’équipe de conception pour le design et l'ergonomie. Documentation sur l'utilisation de l'Arduino et des composants électroniques. IA : Gémini pour le débogage et l'optimisation du code. Copilot pour l'aide à la création de certaines fonctions du code.",
    "ameliorations": "Fonctionnalités supplémentaires : Intégration de nouveaux mini-jeux et d'une interface utilisateur améliorée. Optimisation de l'expérience utilisateur : Tests utilisateurs pour recueillir des retours et ajuster le design. Amélioration de la robustesse : Tests de résistance des composants électroniques et de l'impression 3D.",
    "CEAC": "CE4.01 - Développer pour le web et les médias numériques en se conformant aux standards du web et aux normes d’accessibilités. CE4.04 - Développer pour le web et les médias numériques en utilisant les outils favorisant un développement itératif et collaboratif. AC34.01 - Développer à l’aide d’un framework de développement côté client. AC34.02 - Développer à l’aide d’un framework de développement côté serveur. AC34.03 - Développer des dispositifs interactifs sophistiqués. AC35.01 - Piloter un produit, un service ou une équipe.",
    "apprentissage": "Acquis et apprentissages clés du projet : Conception d'une interface utilisateur interactive. Intégration de composants électroniques avec Arduino. Développement d'une application web pour contrôler le dispositif. Utilisation de l'impression 3D pour créer des éléments personnalisés.",
    "image1": "",
    "lien": "https://github.com/mmi-machedaq/sae501"
  },
  {
    "id": 6,
    "nom": "Maze",
    "categorie": "École, dev web, algo, Unity",
    "ue": "Développer",
    "task": "À l'aide du logiciel unity, créer un labyrinthe et développer un algorithme de résolution. ",
    "livrable": "Algorithme de résolution de labyrinthe.",
    "analyse": "Afin de découvrir les bases de l'algorithmie, j'ai développé un algorithme de résolution de labyrinthe. Le projet a été structuré en plusieurs phases : conception du labyrinthe, développement de l'algorithme de résolution, et tests. Ce projet a permis d'approfondir mes compétences en algorithmie et en développement Unity.",
    "methode": "Pour réaliser l'algorithme, j'ai dans un premier temps consulté les solutions existantes. Avec cette base j'ai reflechi à un système logique et itératif pour résoudre le labyrinthe. J'ai ensuite développé l'algorithme en C# dans Unity, en utilisant des structures de données appropriées pour représenter le labyrinthe et le chemin de résolution. J'ai également intégré une interface utilisateur pour visualiser le processus de résolution. Enfin, j'ai testé l'algorithme avec différents labyrinthes pour vérifier son efficacité.",
    "ressources": " Ressources techniques : Documentation de Unity et C#. Tutoriels en ligne sur les algorithmes de résolution de labyrinthes. Outils de développement : Visual Studio pour le développement C#. IA : Gémini pour le débogage et l'optimisation du code. Copilot pour l'aide à la création de certaines fonctions du code.",
    "ameliorations": "Optimisation de l'algorithme : Amélioration de la vitesse et de l'efficacité de la résolution. Tests supplémentaires : Évaluation de l'algorithme avec des labyrinthes plus complexes.",
    "CEAC": " CE4.03 - Développer pour le web et les médias numériques en produisant un code fonctionnel, sobre et réutilisable. CE4.02 - Développer pour le web et les médias nuémriques en s'appuyant sur des concepts théoriques issus de l'informatique et des sciences de l’information.",
    "apprentissage": "Acquis et apprentissages clés du projet : Compréhension des algorithmes de résolution de labyrinthes. Utilisation de Unity pour le développement de jeux. Développement d'une interface utilisateur pour visualiser l'algorithme en action. Gestion des structures de données pour représenter le labyrinthe et le chemin de résolution.",
    "image1": "",
    "lien": "https://github.com/clementdr/maze"
  },
  {
    "id": 7,
    "nom": "Les coulisses du domaine skiable",
    "categorie": "Évènement, entreprise, vidéo",
    "ue": "Entreprendre",
    "task": "Réaliser une série de vidéos sur les coulisses du domaine skiable de Pralognan-la-Vanoise. Interviewer des professionnels du secteur pour mettre en avant leur travail et leur passion. Créer un contenu engageant et informatif pour les réseaux sociaux.",
    "livrable": "Série de vidéos sur les coulisses du domaine skiable.",
    "analyse": "Dans le cadre de mon alternance, ce projet visait à réaliser une série de vidéos pour mettre en avant les coulisses du domaine skiable de Pralognan-la-Vanoise. L'objectif était de créer un contenu engageant et informatif pour les réseaux sociaux, en interviewant des professionnels du secteur. Le projet a été structuré en plusieurs phases : recherche des intervenants, préparation des interviews, tournage et montage des vidéos puis leur publication. Ce projet a permis de développer mes compétences en production vidéo et en storytelling. ",
    "methode": "Pour réaliser la série de vidéos sur les coulisses du domaine skiable, j’ai suivi ces étapes : Recherche des intervenants : Identifier et contacter les professionnels à interviewer. Préparation des interviews : Élaborer un guide d’entretien et préparer le matériel de tournage. Tournage : Capturer les interviews et les images du domaine skiable. Montage : Utiliser un logiciel de montage pour créer des vidéos dynamiques et engageantes. Publication : Diffuser les vidéos sur les réseaux sociaux de la station.",
    "ressources": "Ressources techniques : Caméra, micro, logiciel de montage (Adobe Premiere Pro). Sources d’inspiration : Vidéos similaires sur les réseaux sociaux. Autres ressources : Collaboration avec l’équipe communication pour la diffusion.",
    "ameliorations": "Diversification des formats : Création de teasers et de contenus courts pour les réseaux sociaux. Analyse des performances : Suivi des statistiques d'engagement et ajustement de la stratégie de publication.",
    "CEAC": "AC32.03 - Concevoir et mettre en oeuvre une communication 360, plurimédia ou transmédia. AC33.03 - Maitriser les étapes de production d’un projet multimédia. AC35.02 - Maîtriser la qualité en projet Web ou multimédia",
    "apprentissage": "Acquis et apprentissages clés du projet : Maîtrise des techniques de production vidéo pour le storytelling en milieu professionnel. Développement de compétences en interview et en gestion de projet vidéo. Utilisation des réseaux sociaux comme outil de communication pour une entreprise touristique. Analyse des données de performance vidéo et ajustement de la stratégie.",
    "image1": "",
    "lien": "https://www.youtube.com/@pralocommunication/videos"
  }
]
